app/Modules/Auth/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `email` = 'rameshkrpenta@gmail.com'
 LIMIT 1
---
	public function attemptLogin()
	{
		// validate request
		$rules = [
			'email'		=> 'required|valid_email',
			'password' 	=> 'required|min_length[8]',
		];

		if (! $this->validate($rules)) {
			return redirect()->to('login')
				->withInput()
				->with('errors', $this->validator->getErrors());
		}

		// check credentials
		$users = new UserModel();
		$user = $users->where('email', $this->request->getPost('email'))->first();