app/Modules/Master/Controllers/Master.php

SELECT *
FROM `branch`
---
	public function branches(){

       if(!$this->access_check()) return redirect()->to('admin-access-denied');

       $model = new BranchModel();
       $data = array();
	   $data['breadcrumb'] = 'Company Branches';
	   $data['config'] = $this->config;

	   $limit = 25;
	   $start = 0;

	   if(isset($_GET['page'])) {
	       $start = $_GET['page']-1;
	       $start = $limit * $start;
	   }

	   $data['start'] = $start;
	   $data['limit'] = $limit;

	   $data['records']=$model->findAll();